In [1]:
import pandas as pd

In [2]:
data = [ ['Juan', 25], ['Pedro', 30], ['Maria', 20]]

df = pd.DataFrame(data, columns=['Nombre', 'Edad'])
df

  Nombre  Edad
0   Juan    25
1  Pedro    30
2  Maria    20

In [3]:
data = {
    'Nombres': ['Juan', 'Pedro', 'Maria'],
    'Edad': [25, 30, 20]
}

df = pd.DataFrame(data)
df

  Nombres  Edad
0    Juan    25
1   Pedro    30
2   Maria    20

In [5]:
# Leer archivos

df = pd.read_csv('./data/data', sep = '|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [7]:
# Leer archivos sin cabeceras
df = pd.read_csv('./data/data_without_header', header=None, names=["nombre","edad","ciudad"])
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [8]:
df = pd.read_json('./data/data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [9]:
# Muestra de 5 elementos
df.head()

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [10]:
df.tail(1)

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [11]:
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [13]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [14]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [15]:
# Manipulacion de datos
df['nombre']

0     Juan
1    María
2    Pedro
Name: nombre, dtype: object

In [16]:
# Para varias columnas
df[['nombre', 'edad']]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [17]:
# seleccionar por indice
df.loc[0]
# varias filas con loc
df.loc[[0,2]]

  nombre  edad   ciudad
0   Juan    25   Madrid
2  Pedro    35  Sevilla

In [18]:
df[df['edad'] > 25]

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [19]:
data = {
    'Grupo': ['A','B','B','A'],
    'Notas': [10, 20, 14, 15]
}

df = pd.DataFrame(data)

In [20]:
# calcular promedio de grupo
promedio = df.groupby('Grupo').mean()
promedio

       Notas
Grupo
A       12.5
B       17.0

In [21]:
# calcular suma de grupo
suma = df.groupby('Grupo').sum()
suma

       Notas
Grupo
A         25
B         34

In [23]:
# Merge
# crear dos Dataframe de ejemplo
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'clave': ['K0', 'K1', 'K2', 'K3']})

df2 = pd.DataFrame({'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3'],
                    'clave': ['K0', 'K5', 'K2', 'K4']})

In [25]:
resultado = df1.merge(df2, on=['clave'], how='left')
resultado

    A   B clave    C    D
0  A0  B0    K0   C0   D0
1  A1  B1    K1  NaN  NaN
2  A2  B2    K2   C2   D2
3  A3  B3    K3  NaN  NaN

In [26]:
resultado = pd.merge(df1, df2, on='clave', how='left')
resultado

    A   B clave    C    D
0  A0  B0    K0   C0   D0
1  A1  B1    K1  NaN  NaN
2  A2  B2    K2   C2   D2
3  A3  B3    K3  NaN  NaN

In [31]:
# Merge
# crear dos Dataframe de ejemplo
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'clave1': ['K0', 'K1', 'K2', 'K3']})

df2 = pd.DataFrame({'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3'],
                    'clave2': ['K0', 'K5', 'K2', 'K4']})

In [32]:
resultado = df1.merge(df2, left_on='clave1', right_on='clave2', how='left')
resultado

    A   B clave1    C    D clave2
0  A0  B0     K0   C0   D0     K0
1  A1  B1     K1  NaN  NaN    NaN
2  A2  B2     K2   C2   D2     K2
3  A3  B3     K3  NaN  NaN    NaN

In [33]:
data = {
    'A': [1, 2, 4, 6],
    'B': [6, 9, 7, 5]
}

df = pd.DataFrame(data)
df

   A  B
0  1  6
1  2  9
2  4  7
3  6  5

In [34]:
df['A_doble'] = df['A'].apply(lambda x: x * 2)
df

   A  B  A_doble
0  1  6        2
1  2  9        4
2  4  7        8
3  6  5       12

In [35]:
def suma(a,b):
    return a + b

In [36]:
df['suma'] = df.apply(lambda row: row['A'] + row['B'], axis = 1)
df

   A  B  A_doble  suma
0  1  6        2     7
1  2  9        4    11
2  4  7        8    11
3  6  5       12    11

In [39]:
def doble_B(b):
    return b*2

In [40]:
df['A_doble'] = df['A'].apply(doble_B())

TypeError: doble_B() missing 1 required positional argument: 'b'